In [27]:
import pandas as pd

In [28]:
df1 = pd.DataFrame([('Ram', 20), ('Rem', 20)], columns=['Nama', 'Umur'])
df2 = pd.DataFrame([('Rom', 45)], columns=['Nama', 'Umur'])

In [29]:
df1

  Nama  Umur
0  Ram    20
1  Rem    20

In [30]:
df2

  Nama  Umur
0  Rom    45

In [31]:
df1.append(df2, ignore_index=True)

  Nama  Umur
0  Ram    20
1  Rem    20
2  Rom    45

In [32]:
df3 = df1.append(df2, ignore_index=True)
df3

  Nama  Umur
0  Ram    20
1  Rem    20
2  Rom    45

In [33]:
#list1 = []
#list1.extend(result)
#csv = pd.DataFrame({"Nama": list1})
#csv.to_csv("hasil.csv", index=False)